{"config": [{"config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa=C:/Users/sookinoby/Dropbox/ML/udacity/project3/model_train.py\u00da\b<lambda>\u0096\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "noramlise", "arguments": {}, "output_shape": null, "batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"nb_row": 3, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 24, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "activation": "linear", "subsample": [1, 1], "border_mode": "valid", "name": "convolution2d_1", "b_regularizer": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"nb_row": 5, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 36, "activity_regularizer": null, "nb_col": 5, "W_regularizer": null, "activation": "linear", "subsample": [2, 2], "border_mode": "same", "name": "convolution2d_2", "b_regularizer": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"nb_row": 4, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 48, "activity_regularizer": null, "nb_col": 5, "W_regularizer": null, "activation": "linear", "subsample": [2, 2], "border_mode": "same", "name": "convolution2d_3", "b_regularizer": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"nb_row": 3, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "activation": "linear", "subsample": [2, 2], "border_mode": "same", "name": "convolution2d_4", "b_regularizer": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"nb_row": 3, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "activation": "linear", "subsample": [2, 2], "border_mode": "same", "name": "convolution2d_5", "b_regularizer": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 1164, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 1024, "W_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_1", "b_regularizer": null, "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"output_dim": 50, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 1164, "W_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_2", "b_regularizer": null, "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"output_dim": 10, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 50, "W_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_3", "b_regularizer": null, "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 10, "W_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_4", "b_regularizer": null, "bias": true, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}